kernel.kasan.t8132.dSYM/Contents/Resources/DWARF/kernel.kasan.t8132:	file format Mach-O arm64

.debug_info contents:
0x00000000: Compile Unit: length = 0x00002890, format = DWARF32, version = 0x0005, unit_type = DW_UT_compile, abbr_offset = 0x0000, addr_size = 0x08 (next unit at 0x00002894)

0x0000000c: DW_TAG_compile_unit
              DW_AT_producer	("Apple clang version 17.0.0 (clang-1700.3.9.904) [+internal-os]")
              DW_AT_language	(DW_LANG_C11)
              DW_AT_name	("gssd/gssd_mach.c")
              DW_AT_LLVM_sysroot	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX26.0.Internal.sdk")
              DW_AT_APPLE_sdk	("MacOSX26.0.Internal.sdk")
              DW_AT_str_offsets_base	(0x00000008)
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN")
              DW_AT_APPLE_optimized	(true)

                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(35)

0x0000002f:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_NO_MECH")
                  DW_AT_const_value	(-1)

0x00000032:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_KRB5_MECH")
                  DW_AT_const_value	(0)

0x00000035:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_SPNEGO_MECH")
                  DW_AT_const_value	(1)

0x00000038:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_NTLM_MECH")
                  DW_AT_const_value	(2)

0x0000003b:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_IAKERB_MECH")
                  DW_AT_const_value	(3)

0x0000003e:     NULL

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x00000043:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_unknown_3ff1	(0x01)
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(328)

0x0000004d:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_NONE")
                  DW_AT_const_value	(0)

0x00000050:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_MOVE_RECEIVE")
                  DW_AT_const_value	(16)

0x00000053:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_MOVE_SEND")
                  DW_AT_const_value	(17)

0x00000056:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_MOVE_SEND_ONCE")
                  DW_AT_const_value	(18)

0x00000059:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_COPY_SEND")
                  DW_AT_const_value	(19)

0x0000005c:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_MAKE_SEND")
                  DW_AT_const_value	(20)

0x0000005f:     DW_TAG_enumerator
                  DW_AT_name	("MACH_MSG_TYPE_MAKE_SEND_ONCE")
                  DW_AT_const_value	(21)

0x00000062:     NULL

0x00000063:   DW_TAG_base_type
                DW_AT_name	("unsigned int")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x04)

0x00000067:   DW_TAG_enumeration_type
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("gssd_nametype")
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(43)

0x00000070:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_STRING_NAME")
                  DW_AT_const_value	(0)

0x00000073:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_EXPORT")
                  DW_AT_const_value	(1)

0x00000076:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_ANONYMOUS")
                  DW_AT_const_value	(2)

0x00000079:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_HOSTBASED")
                  DW_AT_const_value	(3)

0x0000007c:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_USER")
                  DW_AT_const_value	(4)

0x0000007f:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_MACHINE_UID")
                  DW_AT_const_value	(5)

0x00000082:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_STRING_UID")
                  DW_AT_const_value	(6)

0x00000085:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_KRB5_PRINCIPAL")
                  DW_AT_const_value	(7)

0x00000088:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_KRB5_REFERRAL")
                  DW_AT_const_value	(8)

0x0000008b:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_NTLM_PRINCIPAL")
                  DW_AT_const_value	(9)

0x0000008e:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_NTLM_BLOB")
                  DW_AT_const_value	(10)

0x00000091:     DW_TAG_enumerator
                  DW_AT_name	("GSSD_UUID")
                  DW_AT_const_value	(11)

0x00000094:     NULL

0x00000095:   DW_TAG_pointer_type
                DW_AT_type	(0x000000a9 "mach_gss_init_sec_contextMessU")

0x0000009a:   DW_TAG_subprogram
                DW_AT_low_pc	(0xfffffe00073e8000)
                DW_AT_high_pc	(0xfffffe00073e91c4)
                DW_AT_frame_base	(DW_OP_reg29 W29)
                DW_AT_call_all_calls	(true)
                DW_AT_name	("mach_gss_init_sec_context")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                DW_AT_decl_line	(186)
                DW_AT_prototyped	(true)
                DW_AT_type	(0x000014ca "kern_return_t")
                DW_AT_external	(true)
                DW_AT_APPLE_optimized	(true)

0x000000a9:     DW_TAG_union_type
                  DW_AT_name	("mach_gss_init_sec_contextMessU")
                  DW_AT_byte_size	(0x0870)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(291)

0x000000b0:       DW_TAG_member
                    DW_AT_name	("In")
                    DW_AT_type	(0x000000c7 "Request")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(292)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x000000bb:       DW_TAG_member
                    DW_AT_name	("Out")
                    DW_AT_type	(0x00000179 "Reply")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(293)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x000000c6:       NULL

0x000000c7:     DW_TAG_typedef
                  DW_AT_type	(0x000000cf "structure ")
                  DW_AT_name	("Request")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(232)

0x000000cf:     DW_TAG_structure_type
                  DW_AT_byte_size	(0x0870)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(212)
                  DW_AT_alignment	(4)

0x000000d5:       DW_TAG_member
                    DW_AT_name	("Head")
                    DW_AT_type	(0x00000431 "mach_msg_header_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(213)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x000000df:       DW_TAG_member
                    DW_AT_name	("msgh_body")
                    DW_AT_type	(0x000004cc "mach_msg_body_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(215)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x20)

0x000000e9:       DW_TAG_member
                    DW_AT_name	("intoken")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(216)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x24)

0x000000f3:       DW_TAG_member
                    DW_AT_name	("NDR")
                    DW_AT_type	(0x00000592 "NDR_record_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(218)
                    DW_AT_data_member_location	(0x34)

0x000000fc:       DW_TAG_member
                    DW_AT_name	("mech")
                    DW_AT_type	(0x000005eb "gssd_mechtype")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(219)
                    DW_AT_data_member_location	(0x3c)

0x00000105:       DW_TAG_member
                    DW_AT_name	("intokenCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(220)
                    DW_AT_data_member_location	(0x40)

0x0000010e:       DW_TAG_member
                    DW_AT_name	("uid")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(221)
                    DW_AT_data_member_location	(0x44)

0x00000117:       DW_TAG_member
                    DW_AT_name	("princ_namestrOffset")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(222)
                    DW_AT_data_member_location	(0x48)

0x00000120:       DW_TAG_member
                    DW_AT_name	("princ_namestrCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(223)
                    DW_AT_data_member_location	(0x4c)

0x00000129:       DW_TAG_member
                    DW_AT_name	("princ_namestr")
                    DW_AT_type	(0x0000060c "char[1024]")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(224)
                    DW_AT_data_member_location	(0x50)

0x00000132:       DW_TAG_member
                    DW_AT_name	("svc_namestrOffset")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(225)
                    DW_AT_data_member_location	(0x0450)

0x0000013c:       DW_TAG_member
                    DW_AT_name	("svc_namestrCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(226)
                    DW_AT_data_member_location	(0x0454)

0x00000146:       DW_TAG_member
                    DW_AT_name	("svc_namestr")
                    DW_AT_type	(0x0000060c "char[1024]")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(227)
                    DW_AT_data_member_location	(0x0458)

0x00000150:       DW_TAG_member
                    DW_AT_name	("flags")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(228)
                    DW_AT_data_member_location	(0x0858)

0x0000015a:       DW_TAG_member
                    DW_AT_name	("gssd_flags")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(229)
                    DW_AT_data_member_location	(0x085c)

0x00000164:       DW_TAG_member
                    DW_AT_name	("context")
                    DW_AT_type	(0x00000621 "gssd_ctx")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(230)
                    DW_AT_data_member_location	(0x0860)

0x0000016e:       DW_TAG_member
                    DW_AT_name	("cred_handle")
                    DW_AT_type	(0x00000631 "gssd_cred")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(231)
                    DW_AT_data_member_location	(0x0868)

0x00000178:       NULL

0x00000179:     DW_TAG_typedef
                  DW_AT_type	(0x00000182 "structure ")
                  DW_AT_name	("Reply")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(256)

0x00000182:     DW_TAG_structure_type
                  DW_AT_byte_size	(0x78)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(240)
                  DW_AT_alignment	(4)

0x00000187:       DW_TAG_member
                    DW_AT_name	("Head")
                    DW_AT_type	(0x00000431 "mach_msg_header_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(241)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x00000191:       DW_TAG_member
                    DW_AT_name	("msgh_body")
                    DW_AT_type	(0x000004cc "mach_msg_body_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(243)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x20)

0x0000019b:       DW_TAG_member
                    DW_AT_name	("key")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(244)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x24)

0x000001a5:       DW_TAG_member
                    DW_AT_name	("outtoken")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(245)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x34)

0x000001af:       DW_TAG_member
                    DW_AT_name	("NDR")
                    DW_AT_type	(0x00000592 "NDR_record_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(247)
                    DW_AT_data_member_location	(0x44)

0x000001b8:       DW_TAG_member
                    DW_AT_name	("context")
                    DW_AT_type	(0x00000621 "gssd_ctx")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(248)
                    DW_AT_data_member_location	(0x4c)

0x000001c1:       DW_TAG_member
                    DW_AT_name	("cred_handle")
                    DW_AT_type	(0x00000631 "gssd_cred")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(249)
                    DW_AT_data_member_location	(0x54)

0x000001ca:       DW_TAG_member
                    DW_AT_name	("ret_flags")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(250)
                    DW_AT_data_member_location	(0x5c)

0x000001d3:       DW_TAG_member
                    DW_AT_name	("keyCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(251)
                    DW_AT_data_member_location	(0x60)

0x000001dc:       DW_TAG_member
                    DW_AT_name	("outtokenCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(252)
                    DW_AT_data_member_location	(0x64)

0x000001e5:       DW_TAG_member
                    DW_AT_name	("major_stat")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(253)
                    DW_AT_data_member_location	(0x68)

0x000001ee:       DW_TAG_member
                    DW_AT_name	("minor_stat")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(254)
                    DW_AT_data_member_location	(0x6c)

0x000001f7:       DW_TAG_member
                    DW_AT_name	("trailer")
                    DW_AT_type	(0x00000639 "mach_msg_trailer_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(255)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x70)

0x00000201:       NULL

0x00000202:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000000c: 
                     [0xfffffe00073e8000, 0xfffffe00073e8044): DW_OP_reg0 W0
                     [0xfffffe00073e8044, 0xfffffe00073e80a4): DW_OP_reg27 W27
                     [0xfffffe00073e80a4, 0xfffffe00073e8998): DW_OP_breg29 W29-96
                     [0xfffffe00073e8998, 0xfffffe00073e89c8): DW_OP_reg27 W27
                     [0xfffffe00073e89c8, 0xfffffe00073e91c4): DW_OP_breg29 W29-96)
                  DW_AT_name	("server")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(188)
                  DW_AT_type	(0x0000049d "mach_port_t")

0x0000020e:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000033: 
                     [0xfffffe00073e8000, 0xfffffe00073e8040): DW_OP_reg1 W1
                     [0xfffffe00073e8040, 0xfffffe00073e81fc): DW_OP_reg24 W24
                     [0xfffffe00073e8998, 0xfffffe00073e8afc): DW_OP_reg24 W24)
                  DW_AT_name	("mech")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(189)
                  DW_AT_type	(0x000005eb "gssd_mechtype")

0x0000021a:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000048: 
                     [0xfffffe00073e8000, 0xfffffe00073e803c): DW_OP_reg2 W2
                     [0xfffffe00073e803c, 0xfffffe00073e80a0): DW_OP_reg25 W25
                     [0xfffffe00073e8998, 0xfffffe00073e89c8): DW_OP_reg25 W25)
                  DW_AT_name	("intoken")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(190)
                  DW_AT_type	(0x0000071a "gssd_byte_buffer")

0x00000226:     DW_TAG_formal_parameter
                  DW_AT_location	(0x0000005d: 
                     [0xfffffe00073e8000, 0xfffffe00073e8038): DW_OP_reg3 W3
                     [0xfffffe00073e8038, 0xfffffe00073e8260): DW_OP_reg22 W22
                     [0xfffffe00073e8998, 0xfffffe00073e8b64): DW_OP_reg22 W22)
                  DW_AT_name	("intokenCnt")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(191)
                  DW_AT_type	(0x000005f3 "mach_msg_type_number_t")

0x00000232:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000072: 
                     [0xfffffe00073e8000, 0xfffffe00073e8034): DW_OP_reg4 W4
                     [0xfffffe00073e8034, 0xfffffe00073e8258): DW_OP_reg28 W28
                     [0xfffffe00073e8998, 0xfffffe00073e8b64): DW_OP_reg28 W28)
                  DW_AT_name	("uid")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(192)
                  DW_AT_type	(0x000005fc "uint32_t")

0x0000023e:     DW_TAG_formal_parameter
                  DW_AT_location	(0x00000087: 
                     [0xfffffe00073e8000, 0xfffffe00073e8030): DW_OP_reg5 W5
                     [0xfffffe00073e8030, 0xfffffe00073e82d4): DW_OP_reg26 W26
                     [0xfffffe00073e82d4, 0xfffffe00073e8998): DW_OP_entry_value(DW_OP_reg5 W5), DW_OP_stack_value
                     [0xfffffe00073e8998, 0xfffffe00073e8bcc): DW_OP_reg26 W26
                     [0xfffffe00073e8bcc, 0xfffffe00073e91c4): DW_OP_entry_value(DW_OP_reg5 W5), DW_OP_stack_value)
                  DW_AT_name	("princ_namestr")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(193)
                  DW_AT_type	(0x0000280b "gssd_string")

0x0000024a:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000b0: 
                     [0xfffffe00073e8000, 0xfffffe00073e802c): DW_OP_reg6 W6
                     [0xfffffe00073e802c, 0xfffffe00073e832c): DW_OP_reg21 W21
                     [0xfffffe00073e832c, 0xfffffe00073e8998): DW_OP_entry_value(DW_OP_reg6 W6), DW_OP_stack_value
                     [0xfffffe00073e8998, 0xfffffe00073e8c2c): DW_OP_reg21 W21
                     [0xfffffe00073e8c2c, 0xfffffe00073e91c4): DW_OP_entry_value(DW_OP_reg6 W6), DW_OP_stack_value)
                  DW_AT_name	("svc_namestr")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(194)
                  DW_AT_type	(0x0000280b "gssd_string")

0x00000256:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000000d9: 
                     [0xfffffe00073e8000, 0xfffffe00073e8028): DW_OP_reg7 W7
                     [0xfffffe00073e8028, 0xfffffe00073e835c): DW_OP_reg20 W20
                     [0xfffffe00073e8998, 0xfffffe00073e8c60): DW_OP_reg20 W20)
                  DW_AT_name	("flags")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(195)
                  DW_AT_type	(0x000005fc "uint32_t")

0x00000262:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +16)
                  DW_AT_name	("gssd_flags")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(196)
                  DW_AT_type	(0x000005fc "uint32_t")

0x0000026d:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +24)
                  DW_AT_name	("context")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(197)
                  DW_AT_type	(0x00002814 "gssd_ctx *")

0x00000278:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +32)
                  DW_AT_name	("cred_handle")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(198)
                  DW_AT_type	(0x00002819 "gssd_cred *")

0x00000283:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +40)
                  DW_AT_name	("ret_flags")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(199)
                  DW_AT_type	(0x0000281e "uint32_t *")

0x0000028e:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +48)
                  DW_AT_name	("key")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(200)
                  DW_AT_type	(0x00002823 "gssd_byte_buffer *")

0x00000299:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +56)
                  DW_AT_name	("keyCnt")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(201)
                  DW_AT_type	(0x00002828 "mach_msg_type_number_t *")

0x000002a4:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +64)
                  DW_AT_name	("outtoken")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(202)
                  DW_AT_type	(0x00002823 "gssd_byte_buffer *")

0x000002b0:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +72)
                  DW_AT_name	("outtokenCnt")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(203)
                  DW_AT_type	(0x00002828 "mach_msg_type_number_t *")

0x000002bc:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +80)
                  DW_AT_name	("major_stat")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(204)
                  DW_AT_type	(0x0000281e "uint32_t *")

0x000002c8:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg +88)
                  DW_AT_name	("minor_stat")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(205)
                  DW_AT_type	(0x0000281e "uint32_t *")

0x000002d4:     DW_TAG_variable
                  DW_AT_location	(0x000000ee: 
                     [0xfffffe00073e8048, 0xfffffe00073e8054): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8054, 0xfffffe00073e8980): DW_OP_reg19 W19
                     [0xfffffe00073e8998, 0xfffffe00073e91c4): DW_OP_reg19 W19)
                  DW_AT_name	("Mess")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(294)
                  DW_AT_type	(0x00000095 "mach_gss_init_sec_contextMessU *")

0x000002e1:     DW_TAG_variable
                  DW_AT_location	(0x00000104: 
                     [0xfffffe00073e8054, 0xfffffe00073e8960): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8960, 0xfffffe00073e8968): DW_OP_reg22 W22
                     [0xfffffe00073e8998, 0xfffffe00073e91c4): DW_OP_lit0, DW_OP_stack_value)
                  DW_AT_name	("check_result")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(305)
                  DW_AT_type	(0x000014ca "kern_return_t")

0x000002ee:     DW_TAG_variable
                  DW_AT_location	(0x0000011d: 
                     [0xfffffe00073e8054, 0xfffffe00073e8258): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8258, 0xfffffe00073e82d4): DW_OP_reg28 W28
                     [0xfffffe00073e82d4, 0xfffffe00073e86d4): DW_OP_reg26 W26
                     [0xfffffe00073e895c, 0xfffffe00073e8968): DW_OP_reg26 W26
                     [0xfffffe00073e8998, 0xfffffe00073e8b64): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8b64, 0xfffffe00073e8bcc): DW_OP_reg28 W28
                     [0xfffffe00073e8bcc, 0xfffffe00073e8f00): DW_OP_reg26 W26)
                  DW_AT_name	("msgh_size_delta")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(301)
                  DW_AT_type	(0x00000063 "unsigned int")

0x000002fb:     DW_TAG_variable
                  DW_AT_location	(0x00000152: 
                     [0xfffffe00073e8054, 0xfffffe00073e8258): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8998, 0xfffffe00073e8b64): DW_OP_lit0, DW_OP_stack_value)
                  DW_AT_name	("msgh_size")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(300)
                  DW_AT_type	(0x00000063 "unsigned int")

0x00000308:     DW_TAG_variable
                  DW_AT_location	(0x00000164: 
                     [0xfffffe00073e8054, 0xfffffe00073e8438): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8438, 0xfffffe00073e8534): DW_OP_reg22 W22
                     [0xfffffe00073e8554, 0xfffffe00073e8570): DW_OP_reg22 W22
                     [0xfffffe00073e8574, 0xfffffe00073e8578): DW_OP_reg22 W22
                     [0xfffffe00073e857c, 0xfffffe00073e85a4): DW_OP_reg22 W22
                     [0xfffffe00073e8998, 0xfffffe00073e8cc8): DW_OP_lit0, DW_OP_stack_value
                     [0xfffffe00073e8cc8, 0xfffffe00073e8dc4): DW_OP_reg22 W22)
                  DW_AT_name	("msg_result")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(299)
                  DW_AT_type	(0x00001718 "mach_msg_return_t")

0x00000315:     DW_TAG_variable
                  DW_AT_location	(0x00000199: 
                     [0xfffffe00073e8054, 0xfffffe00073e8980): DW_OP_reg19 W19
                     [0xfffffe00073e8998, 0xfffffe00073e91c4): DW_OP_reg19 W19)
                  DW_AT_name	("Out0P")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(297)
                  DW_AT_type	(0x0000282d "Reply *")

0x00000322:     DW_TAG_variable
                  DW_AT_location	(0x000001a9: 
                     [0xfffffe00073e8054, 0xfffffe00073e8260): DW_OP_reg19 W19
                     [0xfffffe00073e8260, 0xfffffe00073e83a8): DW_OP_reg22 W22
                     [0xfffffe00073e83a8, 0xfffffe00073e8980): DW_OP_reg19 W19
                     [0xfffffe00073e8998, 0xfffffe00073e8b64): DW_OP_reg19 W19
                     [0xfffffe00073e8b64, 0xfffffe00073e8c94): DW_OP_reg22 W22
                     [0xfffffe00073e8c94, 0xfffffe00073e91c4): DW_OP_reg19 W19)
                  DW_AT_name	("InP")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(296)
                  DW_AT_type	(0x00000670 "Request *")

0x0000032f:     DW_TAG_lexical_block
                  DW_AT_ranges	(0x0000000c
                     [0xfffffe00073e8460, 0xfffffe00073e8478)
                     [0xfffffe00073e8554, 0xfffffe00073e856c))

0x00000334:       DW_TAG_variable
                    DW_AT_location	(0x000001d5: 
                       [0xfffffe00073e8460, 0xfffffe00073e8478): DW_OP_reg19 W19
                       [0xfffffe00073e8554, 0xfffffe00073e856c): DW_OP_reg19 W19)
                    DW_AT_type	(0x0000169d "mach_msg_header_t *")
                    DW_AT_artificial	(true)

0x0000033d:       NULL

0x0000033e:     DW_TAG_inlined_subroutine
                  DW_AT_abstract_origin	(0x0000164d "__MIG_check__Reply__mach_gss_init_sec_context_t")
                  DW_AT_ranges	(0x00000017
                     [0xfffffe00073e8480, 0xfffffe00073e8554)
                     [0xfffffe00073e8570, 0xfffffe00073e86d0)
                     [0xfffffe00073e8cc8, 0xfffffe00073e8f00))
                  DW_AT_call_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_call_line	(405)
                  DW_AT_call_column	(17)

0x0000034b:       DW_TAG_formal_parameter
                    DW_AT_location	(0x000001e4: 
                       [0xfffffe00073e8480, 0xfffffe00073e8554): DW_OP_reg19 W19
                       [0xfffffe00073e856c, 0xfffffe00073e86d0): DW_OP_reg19 W19
                       [0xfffffe00073e8cc8, 0xfffffe00073e8f00): DW_OP_reg19 W19)
                    DW_AT_abstract_origin	(0x00001656 "Out0P")

0x00000354:       DW_TAG_variable
                    DW_AT_location	(0x000001fb: 
                       [0xfffffe00073e8480, 0xfffffe00073e84fc): DW_OP_lit0, DW_OP_stack_value
                       [0xfffffe00073e84fc, 0xfffffe00073e8510): DW_OP_reg8 W8
                       [0xfffffe00073e856c, 0xfffffe00073e857c): DW_OP_lit0, DW_OP_stack_value
                       [0xfffffe00073e857c, 0xfffffe00073e85c0): DW_OP_reg8 W8
                       [0xfffffe00073e8cc8, 0xfffffe00073e8d5c): DW_OP_lit0, DW_OP_stack_value
                       [0xfffffe00073e8d5c, 0xfffffe00073e8d94): DW_OP_reg8 W8)
                    DW_AT_abstract_origin	(0x0000165e "msgh_size")

0x0000035d:       DW_TAG_variable
                    DW_AT_location	(0x00000228: 
                       [0xfffffe00073e8480, 0xfffffe00073e84d4): DW_OP_lit0, DW_OP_stack_value
                       [0xfffffe00073e856c, 0xfffffe00073e857c): DW_OP_lit0, DW_OP_stack_value
                       [0xfffffe00073e8cc8, 0xfffffe00073e8d2c): DW_OP_lit0, DW_OP_stack_value)
                    DW_AT_abstract_origin	(0x00001666 "msgh_simple")

0x00000366:       DW_TAG_variable
                    DW_AT_location	(0x00000241: 
                       [0xfffffe00073e84b4, 0xfffffe00073e8554): DW_OP_reg19 W19
                       [0xfffffe00073e857c, 0xfffffe00073e86d0): DW_OP_reg19 W19
                       [0xfffffe00073e8cf8, 0xfffffe00073e8f00): DW_OP_reg19 W19)
                    DW_AT_abstract_origin	(0x0000166f)

0x0000036f:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x00000028
                       [0xfffffe00073e8480, 0xfffffe00073e84a4)
                       [0xfffffe00073e8578, 0xfffffe00073e857c)
                       [0xfffffe00073e8cc8, 0xfffffe00073e8cf8))

0x00000374:         DW_TAG_variable
                      DW_AT_location	(0x00000258: 
                         [0xfffffe00073e8480, 0xfffffe00073e84ac): DW_OP_reg19 W19
                         [0xfffffe00073e8cc8, 0xfffffe00073e8cf8): DW_OP_reg19 W19)
                      DW_AT_abstract_origin	(0x00001675)

0x0000037d:         NULL

0x0000037e:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x00000038
                       [0xfffffe00073e84fc, 0xfffffe00073e8534)
                       [0xfffffe00073e8580, 0xfffffe00073e85b4)
                       [0xfffffe00073e8d5c, 0xfffffe00073e8dc4))

0x00000383:         DW_TAG_variable
                      DW_AT_location	(0x00000267: 
                         [0xfffffe00073e8508, 0xfffffe00073e8538): DW_OP_reg19 W19
                         [0xfffffe00073e8d94, 0xfffffe00073e8dc4): DW_OP_reg19 W19)
                      DW_AT_abstract_origin	(0x0000167c)

0x0000038c:         DW_TAG_variable
                      DW_AT_location	(0x00000276: 
                         [0xfffffe00073e857c, 0xfffffe00073e85b4): DW_OP_breg29 W29-104
                         [0xfffffe00073e8d5c, 0xfffffe00073e8d94): DW_OP_breg29 W29-104)
                      DW_AT_abstract_origin	(0x00001681)

0x00000395:         NULL

0x00000396:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x00000048
                       [0xfffffe00073e8538, 0xfffffe00073e8548)
                       [0xfffffe00073e85b4, 0xfffffe00073e85c8))

0x0000039b:         DW_TAG_variable
                      DW_AT_location	(0x00000289: 
                         [0xfffffe00073e8538, 0xfffffe00073e8554): DW_OP_reg19 W19
                         [0xfffffe00073e85b4, 0xfffffe00073e85c8): DW_OP_reg19 W19)
                      DW_AT_abstract_origin	(0x00001688)

0x000003a4:         NULL

0x000003a5:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x00000052
                       [0xfffffe00073e862c, 0xfffffe00073e8674)
                       [0xfffffe00073e8e24, 0xfffffe00073e8e90))

0x000003aa:         DW_TAG_variable
                      DW_AT_location	(0x00000297: 
                         [0xfffffe00073e8628, 0xfffffe00073e867c): DW_OP_breg19 W19+36, DW_OP_stack_value
                         [0xfffffe00073e8e24, 0xfffffe00073e8e90): DW_OP_breg19 W19+36, DW_OP_stack_value)
                      DW_AT_abstract_origin	(0x0000168f)

0x000003b3:         NULL

0x000003b4:       DW_TAG_lexical_block
                    DW_AT_ranges	(0x0000005d
                       [0xfffffe00073e8680, 0xfffffe00073e86c8)
                       [0xfffffe00073e8e90, 0xfffffe00073e8f00))

0x000003b9:         DW_TAG_variable
                      DW_AT_location	(0x000002aa: 
                         [0xfffffe00073e867c, 0xfffffe00073e86d0): DW_OP_breg19 W19+52, DW_OP_stack_value
                         [0xfffffe00073e8e90, 0xfffffe00073e8f00): DW_OP_breg19 W19+52, DW_OP_stack_value)
                      DW_AT_abstract_origin	(0x00001696)

0x000003c2:         NULL

0x000003c3:       NULL

0x000003c4:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016ac "mig_user_allocate")
                  DW_AT_call_return_pc	(0xfffffe00073e8050)

0x000003ca:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg0 W0)
                    DW_AT_call_value	(DW_OP_constu 0x870)

0x000003d1:       NULL

0x000003d2:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016c4 "mig_strncpy_zerofill")
                  DW_AT_call_return_pc	(0xfffffe00073e81f0)

0x000003d8:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016dd "mig_strncpy")
                  DW_AT_call_return_pc	(0xfffffe00073e81f8)

0x000003de:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016c4 "mig_strncpy_zerofill")
                  DW_AT_call_return_pc	(0xfffffe00073e8274)

0x000003e4:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016dd "mig_strncpy")
                  DW_AT_call_return_pc	(0xfffffe00073e827c)

0x000003ea:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016f6 "mig_get_reply_port")
                  DW_AT_call_return_pc	(0xfffffe00073e83ac)

0x000003f0:     DW_TAG_call_site
                  DW_AT_call_origin	(0x000016ff "mach_msg_rpc_from_kernel")
                  DW_AT_call_return_pc	(0xfffffe00073e8434)

0x000003f6:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg2 W2)
                    DW_AT_call_value	(DW_OP_constu 0x78)

0x000003fc:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg0 W0)
                    DW_AT_call_value	(DW_OP_breg19 W19+0)

0x00000402:       NULL

0x00000403:     DW_TAG_call_site
                  DW_AT_call_origin	(0x00001722 "mig_put_reply_port")
                  DW_AT_call_return_pc	(0xfffffe00073e8474)

0x00000409:     DW_TAG_call_site
                  DW_AT_call_origin	(0x0000172d "mig_dealloc_reply_port")
                  DW_AT_call_return_pc	(0xfffffe00073e8568)

0x0000040f:     DW_TAG_call_site
                  DW_AT_call_origin	(0x00001738 "mach_msg_destroy_from_kernel")
                  DW_AT_call_return_pc	(0xfffffe00073e8968)

0x00000415:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg0 W0)
                    DW_AT_call_value	(DW_OP_breg19 W19+0)

0x0000041b:       NULL

0x0000041c:     DW_TAG_call_site
                  DW_AT_call_origin	(0x00001743 "mig_user_deallocate")
                  DW_AT_call_return_pc	(0xfffffe00073e8974)

0x00000422:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg1 W1)
                    DW_AT_call_value	(DW_OP_constu 0x870)

0x00000429:       DW_TAG_call_site_parameter
                    DW_AT_location	(DW_OP_reg0 W0)
                    DW_AT_call_value	(DW_OP_breg19 W19+0)

0x0000042f:       NULL

0x00000430:     NULL

0x00000431:   DW_TAG_typedef
                DW_AT_type	(0x0000043a "structure ")
                DW_AT_name	("mach_msg_header_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(603)

0x0000043a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(596)
                DW_AT_alignment	(4)

0x00000440:     DW_TAG_member
                  DW_AT_name	("msgh_bits")
                  DW_AT_type	(0x0000047d "mach_msg_bits_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(597)
                  DW_AT_data_member_location	(0x00)

0x0000044a:     DW_TAG_member
                  DW_AT_name	("msgh_size")
                  DW_AT_type	(0x00000485 "mach_msg_size_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(598)
                  DW_AT_data_member_location	(0x04)

0x00000454:     DW_TAG_member
                  DW_AT_name	("msgh_remote_port")
                  DW_AT_type	(0x0000049d "mach_port_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(599)
                  DW_AT_data_member_location	(0x08)

0x0000045e:     DW_TAG_member
                  DW_AT_name	("msgh_local_port")
                  DW_AT_type	(0x0000049d "mach_port_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(600)
                  DW_AT_data_member_location	(0x10)

0x00000468:     DW_TAG_member
                  DW_AT_name	("msgh_voucher_port")
                  DW_AT_type	(0x000004b4 "mach_port_name_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(601)
                  DW_AT_data_member_location	(0x18)

0x00000472:     DW_TAG_member
                  DW_AT_name	("msgh_id")
                  DW_AT_type	(0x000004bc "mach_msg_id_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(602)
                  DW_AT_data_member_location	(0x1c)

0x0000047c:     NULL

0x0000047d:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("mach_msg_bits_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(230)

0x00000485:   DW_TAG_typedef
                DW_AT_type	(0x0000048d "natural_t")
                DW_AT_name	("mach_msg_size_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(231)

0x0000048d:   DW_TAG_typedef
                DW_AT_type	(0x00000495 "__darwin_natural_t")
                DW_AT_name	("natural_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/arm/vm_types.h")
                DW_AT_decl_line	(96)

0x00000495:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("__darwin_natural_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/arm/_types.h")
                DW_AT_decl_line	(51)

0x0000049d:   DW_TAG_typedef
                DW_AT_type	(0x000004a5 "ipc_port_t")
                DW_AT_name	("mach_port_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/port.h")
                DW_AT_decl_line	(156)

0x000004a5:   DW_TAG_typedef
                DW_AT_type	(0x000004ad "ipc_port *")
                DW_AT_name	("ipc_port_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/port.h")
                DW_AT_decl_line	(144)

0x000004ad:   DW_TAG_pointer_type
                DW_AT_type	(0x000004b2 "ipc_port")

0x000004b2:   DW_TAG_structure_type
                DW_AT_name	("ipc_port")
                DW_AT_declaration	(true)

0x000004b4:   DW_TAG_typedef
                DW_AT_type	(0x0000048d "natural_t")
                DW_AT_name	("mach_port_name_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/port.h")
                DW_AT_decl_line	(109)

0x000004bc:   DW_TAG_typedef
                DW_AT_type	(0x000004c4 "integer_t")
                DW_AT_name	("mach_msg_id_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(232)

0x000004c4:   DW_TAG_typedef
                DW_AT_type	(0x0000003f "int")
                DW_AT_name	("integer_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/arm/vm_types.h")
                DW_AT_decl_line	(97)

0x000004cc:   DW_TAG_typedef
                DW_AT_type	(0x000004d5 "structure ")
                DW_AT_name	("mach_msg_body_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(591)

0x000004d5:   DW_TAG_structure_type
                DW_AT_byte_size	(0x04)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(589)
                DW_AT_alignment	(4)

0x000004db:     DW_TAG_member
                  DW_AT_name	("msgh_descriptor_count")
                  DW_AT_type	(0x00000485 "mach_msg_size_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(590)
                  DW_AT_data_member_location	(0x00)

0x000004e5:     NULL

0x000004e6:   DW_TAG_typedef
                DW_AT_type	(0x000004ef "structure ")
                DW_AT_name	("mach_msg_ool_descriptor_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(477)

0x000004ef:   DW_TAG_structure_type
                DW_AT_byte_size	(0x10)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(454)
                DW_AT_alignment	(4)

0x000004f5:     DW_TAG_member
                  DW_AT_type	(0x000004ff "structure ::union ")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(456)
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000004ff:     DW_TAG_union_type
                  DW_AT_byte_size	(0x08)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(456)
                  DW_AT_alignment	(4)

0x00000505:       DW_TAG_member
                    DW_AT_name	("address")
                    DW_AT_type	(0x0000055b "void *__ptrauth(2, 1, 0x05d4f)")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                    DW_AT_decl_line	(457)
                    DW_AT_data_member_location	(0x00)

0x0000050f:       DW_TAG_member
                    DW_AT_name	("kext_address")
                    DW_AT_type	(0x00000563 "void *")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                    DW_AT_decl_line	(458)
                    DW_AT_data_member_location	(0x00)

0x00000519:       DW_TAG_member
                    DW_AT_name	("u_address")
                    DW_AT_type	(0x00000564 "user_addr_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                    DW_AT_decl_line	(459)
                    DW_AT_data_member_location	(0x00)

0x00000523:       NULL

0x00000524:     DW_TAG_member
                  DW_AT_name	("deallocate")
                  DW_AT_type	(0x00000578 "boolean_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(467)
                  DW_AT_bit_size	(0x08)
                  DW_AT_data_bit_offset	(0x40)

0x0000052f:     DW_TAG_member
                  DW_AT_name	("copy")
                  DW_AT_type	(0x00000580 "mach_msg_copy_options_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(468)
                  DW_AT_bit_size	(0x08)
                  DW_AT_data_bit_offset	(0x48)

0x0000053a:     DW_TAG_member
                  DW_AT_name	("pad1")
                  DW_AT_type	(0x00000063 "unsigned int")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(469)
                  DW_AT_bit_size	(0x08)
                  DW_AT_data_bit_offset	(0x50)

0x00000545:     DW_TAG_member
                  DW_AT_name	("type")
                  DW_AT_type	(0x00000589 "mach_msg_descriptor_type_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(470)
                  DW_AT_bit_size	(0x08)
                  DW_AT_data_bit_offset	(0x58)

0x00000550:     DW_TAG_member
                  DW_AT_name	("size")
                  DW_AT_type	(0x00000485 "mach_msg_size_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(472)
                  DW_AT_data_member_location	(0x0c)

0x0000055a:     NULL

0x0000055b:   DW_TAG_LLVM_ptrauth_type
                DW_AT_type	(0x00000563 "void *")
                DW_AT_LLVM_ptrauth_key	(0x02)
                DW_AT_LLVM_ptrauth_address_discriminated	(true)
                DW_AT_LLVM_ptrauth_extra_discriminator	(0x5d4f)

0x00000563:   DW_TAG_pointer_type

0x00000564:   DW_TAG_typedef
                DW_AT_type	(0x0000056c "u_int64_t")
                DW_AT_name	("user_addr_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/arm/types.h")
                DW_AT_decl_line	(77)

0x0000056c:   DW_TAG_typedef
                DW_AT_type	(0x00000574 "unsigned long long")
                DW_AT_name	("u_int64_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/sys/_types/_u_int64_t.h")
                DW_AT_decl_line	(30)

0x00000574:   DW_TAG_base_type
                DW_AT_name	("unsigned long long")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x08)

0x00000578:   DW_TAG_typedef
                DW_AT_type	(0x0000003f "int")
                DW_AT_name	("boolean_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/arm/boolean.h")
                DW_AT_decl_line	(70)

0x00000580:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("mach_msg_copy_options_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(352)

0x00000589:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("mach_msg_descriptor_type_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(380)

0x00000592:   DW_TAG_typedef
                DW_AT_type	(0x0000059a "structure ")
                DW_AT_name	("NDR_record_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                DW_AT_decl_line	(49)

0x0000059a:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                DW_AT_decl_line	(40)

0x0000059e:     DW_TAG_member
                  DW_AT_name	("mig_vers")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(41)
                  DW_AT_data_member_location	(0x00)

0x000005a7:     DW_TAG_member
                  DW_AT_name	("if_vers")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(42)
                  DW_AT_data_member_location	(0x01)

0x000005b0:     DW_TAG_member
                  DW_AT_name	("reserved1")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(43)
                  DW_AT_data_member_location	(0x02)

0x000005b9:     DW_TAG_member
                  DW_AT_name	("mig_encoding")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(44)
                  DW_AT_data_member_location	(0x03)

0x000005c2:     DW_TAG_member
                  DW_AT_name	("int_rep")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(45)
                  DW_AT_data_member_location	(0x04)

0x000005cb:     DW_TAG_member
                  DW_AT_name	("char_rep")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(46)
                  DW_AT_data_member_location	(0x05)

0x000005d4:     DW_TAG_member
                  DW_AT_name	("float_rep")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(47)
                  DW_AT_data_member_location	(0x06)

0x000005dd:     DW_TAG_member
                  DW_AT_name	("reserved2")
                  DW_AT_type	(0x000005e7 "unsigned char")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/ndr.h")
                  DW_AT_decl_line	(48)
                  DW_AT_data_member_location	(0x07)

0x000005e6:     NULL

0x000005e7:   DW_TAG_base_type
                DW_AT_name	("unsigned char")
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_byte_size	(0x01)

0x000005eb:   DW_TAG_typedef
                DW_AT_type	(0x00000026 "gssd_mechtype")
                DW_AT_name	("gssd_mechtype")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(41)

0x000005f3:   DW_TAG_typedef
                DW_AT_type	(0x0000048d "natural_t")
                DW_AT_name	("mach_msg_type_number_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(956)

0x000005fc:   DW_TAG_typedef
                DW_AT_type	(0x00000604 "u_int32_t")
                DW_AT_name	("uint32_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/EXTERNAL_HEADERS/stdint.h")
                DW_AT_decl_line	(40)

0x00000604:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("u_int32_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/sys/_types/_u_int32_t.h")
                DW_AT_decl_line	(30)

0x0000060c:   DW_TAG_array_type
                DW_AT_type	(0x00000619 "char")

0x00000611:     DW_TAG_subrange_type
                  DW_AT_type	(0x0000061d "__ARRAY_SIZE_TYPE__")
                  DW_AT_count	(0x0400)

0x00000618:     NULL

0x00000619:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x0000061d:   DW_TAG_base_type
                DW_AT_name	("__ARRAY_SIZE_TYPE__")
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)

0x00000621:   DW_TAG_typedef
                DW_AT_type	(0x00000629 "uint64_t")
                DW_AT_name	("gssd_ctx")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(62)

0x00000629:   DW_TAG_typedef
                DW_AT_type	(0x0000056c "u_int64_t")
                DW_AT_name	("uint64_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/EXTERNAL_HEADERS/stdint.h")
                DW_AT_decl_line	(41)

0x00000631:   DW_TAG_typedef
                DW_AT_type	(0x00000629 "uint64_t")
                DW_AT_name	("gssd_cred")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(63)

0x00000639:   DW_TAG_typedef
                DW_AT_type	(0x00000642 "structure ")
                DW_AT_name	("mach_msg_trailer_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(702)

0x00000642:   DW_TAG_structure_type
                DW_AT_byte_size	(0x08)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(699)
                DW_AT_alignment	(4)

0x00000648:     DW_TAG_member
                  DW_AT_name	("msgh_trailer_type")
                  DW_AT_type	(0x0000065d "mach_msg_trailer_type_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(700)
                  DW_AT_data_member_location	(0x00)

0x00000652:     DW_TAG_member
                  DW_AT_name	("msgh_trailer_size")
                  DW_AT_type	(0x00000666 "mach_msg_trailer_size_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                  DW_AT_decl_line	(701)
                  DW_AT_data_member_location	(0x04)

0x0000065c:     NULL

0x0000065d:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("mach_msg_trailer_type_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(692)

0x00000666:   DW_TAG_typedef
                DW_AT_type	(0x00000063 "unsigned int")
                DW_AT_name	("mach_msg_trailer_size_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/mach/message.h")
                DW_AT_decl_line	(696)

0x00000670:   DW_TAG_pointer_type
                DW_AT_type	(0x000000c7 "Request")

0x00000675:   DW_TAG_typedef
                DW_AT_type	(0x0000067e "unsigned long")
                DW_AT_name	("uintptr_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/sys/_types/_uintptr_t.h")
                DW_AT_decl_line	(34)

0x0000067e:   DW_TAG_base_type
                DW_AT_name	("unsigned long")
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_byte_size	(0x08)

0x00000683:   DW_TAG_pointer_type
                DW_AT_type	(0x00000619 "char")

0x00000688:   DW_TAG_pointer_type
                DW_AT_type	(0x0000068d "__Reply__mach_gss_init_sec_context_t")

0x0000068d:   DW_TAG_typedef
                DW_AT_type	(0x00000697 "structure ")
                DW_AT_name	("__Reply__mach_gss_init_sec_context_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                DW_AT_decl_line	(549)

0x00000697:   DW_TAG_structure_type
                DW_AT_byte_size	(0x70)
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                DW_AT_decl_line	(534)
                DW_AT_alignment	(4)

0x0000069d:     DW_TAG_member
                  DW_AT_name	("Head")
                  DW_AT_type	(0x00000431 "mach_msg_header_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(535)
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x00)

0x000006a8:     DW_TAG_member
                  DW_AT_name	("msgh_body")
                  DW_AT_type	(0x000004cc "mach_msg_body_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(537)
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x20)

0x000006b3:     DW_TAG_member
                  DW_AT_name	("key")
                  DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(538)
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x24)

0x000006be:     DW_TAG_member
                  DW_AT_name	("outtoken")
                  DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(539)
                  DW_AT_alignment	(4)
                  DW_AT_data_member_location	(0x34)

0x000006c9:     DW_TAG_member
                  DW_AT_name	("NDR")
                  DW_AT_type	(0x00000592 "NDR_record_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(541)
                  DW_AT_data_member_location	(0x44)

0x000006d3:     DW_TAG_member
                  DW_AT_name	("context")
                  DW_AT_type	(0x00000621 "gssd_ctx")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(542)
                  DW_AT_data_member_location	(0x4c)

0x000006dd:     DW_TAG_member
                  DW_AT_name	("cred_handle")
                  DW_AT_type	(0x00000631 "gssd_cred")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(543)
                  DW_AT_data_member_location	(0x54)

0x000006e7:     DW_TAG_member
                  DW_AT_name	("ret_flags")
                  DW_AT_type	(0x000005fc "uint32_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(544)
                  DW_AT_data_member_location	(0x5c)

0x000006f1:     DW_TAG_member
                  DW_AT_name	("keyCnt")
                  DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(545)
                  DW_AT_data_member_location	(0x60)

0x000006fb:     DW_TAG_member
                  DW_AT_name	("outtokenCnt")
                  DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(546)
                  DW_AT_data_member_location	(0x64)

0x00000705:     DW_TAG_member
                  DW_AT_name	("major_stat")
                  DW_AT_type	(0x000005fc "uint32_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(547)
                  DW_AT_data_member_location	(0x68)

0x0000070f:     DW_TAG_member
                  DW_AT_name	("minor_stat")
                  DW_AT_type	(0x000005fc "uint32_t")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.h")
                  DW_AT_decl_line	(548)
                  DW_AT_data_member_location	(0x6c)

0x00000719:     NULL

0x0000071a:   DW_TAG_typedef
                DW_AT_type	(0x00000723 "uint8_t *")
                DW_AT_name	("gssd_byte_buffer")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/osfmk/gssd/gssd_mach_types.h")
                DW_AT_decl_line	(60)

0x00000723:   DW_TAG_pointer_type
                DW_AT_type	(0x00000728 "uint8_t")

0x00000728:   DW_TAG_typedef
                DW_AT_type	(0x00000731 "u_int8_t")
                DW_AT_name	("uint8_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Sources/xnu_kasan/EXTERNAL_HEADERS/stdint.h")
                DW_AT_decl_line	(38)

0x00000731:   DW_TAG_typedef
                DW_AT_type	(0x000005e7 "unsigned char")
                DW_AT_name	("u_int8_t")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/EXPORT_HDRS/bsd/sys/_types/_u_int8_t.h")
                DW_AT_decl_line	(30)

0x0000073a:   DW_TAG_pointer_type
                DW_AT_type	(0x00000750 "mach_gss_accept_sec_contextMessU")

0x0000073f:   DW_TAG_subprogram
                DW_AT_low_pc	(0xfffffe00073e91c4)
                DW_AT_high_pc	(0xfffffe00073ea484)
                DW_AT_frame_base	(DW_OP_reg29 W29)
                DW_AT_call_all_calls	(true)
                DW_AT_name	("mach_gss_accept_sec_context")
                DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                DW_AT_decl_line	(514)
                DW_AT_prototyped	(true)
                DW_AT_type	(0x000014ca "kern_return_t")
                DW_AT_external	(true)
                DW_AT_APPLE_optimized	(true)

0x00000750:     DW_TAG_union_type
                  DW_AT_name	("mach_gss_accept_sec_contextMessU")
                  DW_AT_byte_size	(0x045c)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(618)

0x00000758:       DW_TAG_member
                    DW_AT_name	("In")
                    DW_AT_type	(0x0000076f "Request")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(619)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x00000763:       DW_TAG_member
                    DW_AT_name	("Out")
                    DW_AT_type	(0x000007f4 "Reply")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(620)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x0000076e:       NULL

0x0000076f:     DW_TAG_typedef
                  DW_AT_type	(0x00000778 "structure ")
                  DW_AT_name	("Request")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(553)

0x00000778:     DW_TAG_structure_type
                  DW_AT_byte_size	(0x045c)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(539)
                  DW_AT_alignment	(4)

0x0000077f:       DW_TAG_member
                    DW_AT_name	("Head")
                    DW_AT_type	(0x00000431 "mach_msg_header_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(540)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x0000078a:       DW_TAG_member
                    DW_AT_name	("msgh_body")
                    DW_AT_type	(0x000004cc "mach_msg_body_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(542)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x20)

0x00000795:       DW_TAG_member
                    DW_AT_name	("intoken")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(543)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x24)

0x000007a0:       DW_TAG_member
                    DW_AT_name	("NDR")
                    DW_AT_type	(0x00000592 "NDR_record_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(545)
                    DW_AT_data_member_location	(0x34)

0x000007aa:       DW_TAG_member
                    DW_AT_name	("intokenCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(546)
                    DW_AT_data_member_location	(0x3c)

0x000007b4:       DW_TAG_member
                    DW_AT_name	("svc_namestrOffset")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(547)
                    DW_AT_data_member_location	(0x40)

0x000007be:       DW_TAG_member
                    DW_AT_name	("svc_namestrCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(548)
                    DW_AT_data_member_location	(0x44)

0x000007c8:       DW_TAG_member
                    DW_AT_name	("svc_namestr")
                    DW_AT_type	(0x0000060c "char[1024]")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(549)
                    DW_AT_data_member_location	(0x48)

0x000007d2:       DW_TAG_member
                    DW_AT_name	("gssd_flags")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(550)
                    DW_AT_data_member_location	(0x0448)

0x000007dd:       DW_TAG_member
                    DW_AT_name	("context")
                    DW_AT_type	(0x00000621 "gssd_ctx")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(551)
                    DW_AT_data_member_location	(0x044c)

0x000007e8:       DW_TAG_member
                    DW_AT_name	("cred_handle")
                    DW_AT_type	(0x00000631 "gssd_cred")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(552)
                    DW_AT_data_member_location	(0x0454)

0x000007f3:       NULL

0x000007f4:     DW_TAG_typedef
                  DW_AT_type	(0x000007fd "structure ")
                  DW_AT_name	("Reply")
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(580)

0x000007fd:     DW_TAG_structure_type
                  DW_AT_byte_size	(0xc0)
                  DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                  DW_AT_decl_line	(561)
                  DW_AT_alignment	(4)

0x00000803:       DW_TAG_member
                    DW_AT_name	("Head")
                    DW_AT_type	(0x00000431 "mach_msg_header_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(562)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x00)

0x0000080e:       DW_TAG_member
                    DW_AT_name	("msgh_body")
                    DW_AT_type	(0x000004cc "mach_msg_body_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(564)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x20)

0x00000819:       DW_TAG_member
                    DW_AT_name	("key")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(565)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x24)

0x00000824:       DW_TAG_member
                    DW_AT_name	("outtoken")
                    DW_AT_type	(0x000004e6 "mach_msg_ool_descriptor_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(566)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0x34)

0x0000082f:       DW_TAG_member
                    DW_AT_name	("NDR")
                    DW_AT_type	(0x00000592 "NDR_record_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(568)
                    DW_AT_data_member_location	(0x44)

0x00000839:       DW_TAG_member
                    DW_AT_name	("context")
                    DW_AT_type	(0x00000621 "gssd_ctx")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(569)
                    DW_AT_data_member_location	(0x4c)

0x00000843:       DW_TAG_member
                    DW_AT_name	("cred_handle")
                    DW_AT_type	(0x00000631 "gssd_cred")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(570)
                    DW_AT_data_member_location	(0x54)

0x0000084d:       DW_TAG_member
                    DW_AT_name	("flags")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(571)
                    DW_AT_data_member_location	(0x5c)

0x00000857:       DW_TAG_member
                    DW_AT_name	("uid")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(572)
                    DW_AT_data_member_location	(0x60)

0x00000861:       DW_TAG_member
                    DW_AT_name	("gidsCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(573)
                    DW_AT_data_member_location	(0x64)

0x0000086c:       DW_TAG_member
                    DW_AT_name	("gids")
                    DW_AT_type	(0x00000b10 "uint32_t[16]")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(574)
                    DW_AT_data_member_location	(0x68)

0x00000877:       DW_TAG_member
                    DW_AT_name	("keyCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(575)
                    DW_AT_data_member_location	(0xa8)

0x00000881:       DW_TAG_member
                    DW_AT_name	("outtokenCnt")
                    DW_AT_type	(0x000005f3 "mach_msg_type_number_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(576)
                    DW_AT_data_member_location	(0xac)

0x0000088b:       DW_TAG_member
                    DW_AT_name	("major_stat")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(577)
                    DW_AT_data_member_location	(0xb0)

0x00000895:       DW_TAG_member
                    DW_AT_name	("minor_stat")
                    DW_AT_type	(0x000005fc "uint32_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(578)
                    DW_AT_data_member_location	(0xb4)

0x0000089f:       DW_TAG_member
                    DW_AT_name	("trailer")
                    DW_AT_type	(0x00000639 "mach_msg_trailer_t")
                    DW_AT_decl_file	("/AppleInternal/Library/BuildRoots/4~B1_9ugAkE_AouHX-GrL2F-amFRITcyoKGLoQbAo/Library/Caches/com.apple.xbs/Binaries/xnu_kasan/install/TempContent/Objects/KASAN_ARM64_T8132/osfmk/KASAN/gssd/gssd_mach.c")
                    DW_AT_decl_line	(579)
                    DW_AT_alignment	(4)
                    DW_AT_data_member_location	(0xb8)

0x000008aa:       NULL

0x000008ab:     DW_TAG_formal_parameter
                  DW_AT_location	(0x000002bd: 
